{
  "1001": "The hymn praises Agni as the divine priest who carries offerings to the gods, brings wealth and protection, and serves as a radiant, ever‑present guardian of law and prosperity for humanity.",
  "1002": "A fervent prayer invites the wind and thunder‑god to drink the freshly poured Soma, urging them and the law‑gods Mitra and Varuṇa to join the ritual so their power and blessings may empower the worshippers.",
  "1003": "The hymn calls the swift, treasure‑rich Aśvins, the blazing Indra, the ever‑present Viśvedevas, and the luminous Sarasvatī to accept the offered libations and songs, urging these divine helpers to bless and",
  "1004": "A vibrant hymn praises Indra as the generous, victorious protector who blesses warriors, grants wealth, and invites worshippers to share Soma and sacrifice in hopes of his benevolent aid.",
  "1005": "A lively invitation urges the singers to praise Indra with abundant Soma‑filled offerings, invoking his strength, protection, and love of song to bring wealth, victory and safety to the gathered companions.",
  "1006": "A vivid hymn celebrates Indra’s radiant chariot and his storm‑god companions as they blaze across the sky, drive fierce steeds, break open the earth’s hidden cattle, and grant wealth and protection to worshippers who call for his swift,",
  "1007": "A fervent hymn hails Indra as the thunder‑armed, sun‑lifting, battle‑winning deity who drives his chariot and steeds to crush foes, protect warriors, and dominate all peoples and riches.",
  "1008": "A vibrant prayer asks thunder‑armed Indra to grant victorious wealth, protect warriors in battle, and bless the worshipper with abundant riches and divine favor.",
  "1009": "A vibrant hymn calls on Indra, the mighty protector and giver of wealth, to accept the Soma libations, bless the singers with abundant riches, fame and strength, and sustain them with his powerful, life‑affirming presence.",
  "1010": "A fervent prayer calls on Indra, the thunder‑god, to hear the singers’ praise, grant rain, wealth, victorious strength and long life, and bless their sacrifice with abundant gifts.",
  "1011": "A vibrant hymn celebrates Indra as the mighty thunder‑god who conquers foes, breaks caves, bestows abundant cattle and protection, and inspires fearless warriors and singers alike.",
  "1012": "The hymn passionately calls on Agni, the fire‑messenger and household protector, to carry the offering, summon the gods, burn away enemies, and bless the sacrificers with wealth, safety and prosperity.",
  "1013": "A vibrant hymn invokes Agni to summon the gods, enlists divine priests and goddesses, and describes the elaborate ritual of offering sacred grass, oil, and prayers so that the sacrifice may be gloriously accepted.",
  "1014": "A fervent hymn calls fire‑god Agni, alongside the assembled deities, to join the sacrificial feast, drink the Soma and meat offerings, and carry the worshippers’ prayers to the divine realm.",
  "1015": "A vibrant hymn urges the gods—Indra, the Maruts, Neṣṭar, Agni, Mitra, Varuṇa, the Wealth‑giver, and the Aśvins—to drink the sacred Soma with the seasonal rites",
  "1016": "A vibrant hymn urges the bright, sun‑like Indra, riding his swift bay horses, to come and drink the freshly pressed Soma offering, promising him strength, delight, and the fulfillment of the worshippers’ wishes.",
  "1017": "A hymn pleading to the twin deities Indra‑Varuṇa for their swift protection, abundant wealth, and victorious power, urging them to hear the singer’s praise and share their generous strength.",
  "1018": "A prayer to Brahmanaspati asks that the divine patron of Soma protect and empower the worshipper, granting wealth, health, and success in sacrifice while shielding them from enemies and ensuring the favor of Indra, Soma and the other gods.",
  "1019": "A powerful hymn calls fire and the storm‑gods together, praising their unmatched mental might, fierce, radiant battle‑spirit that rules the sky and sea, and offering them a sacred drink of soma‑mixed meat.",
  "1020": "The hymn celebrates how divine artisans—singers, craftsmen, and priests—create wondrous gifts like horses, chariots, a nectar‑producing cow, rejuvenated parents, and sacred ladles for Indra’s rites, and impl",
  "1021": "A vibrant hymn summons the mighty Indra and Agni, the chief Soma‑drinkers, urging them to join the ritual, vanquish foes, and bestow bliss upon the gathered worshippers.",
  "1022": "A vibrant hymn calls the twin sun‑riders, the Aśvins, and the radiant god Savitar to awaken, drive their divine chariot, pour Soma and bring their celestial spouses, while invoking Agni, Tvaṣṭ",
  "1023": "A vibrant hymn summons the chief gods—Indra, Vāyu, Mitra, Varuṇa, the Maruts, Pūṣan, and Agni—offering them mixed soma and milk, invoking their protection, strength, and",
  "1024": "A prayerful hymn invokes the chief gods—Agni, Savitar, and Varuṇa—to restore the speaker to the protective embrace of Aditi, grant wealth and freedom from sin, and uphold cosmic order through their divine power.",
  "1025": "A pleading hymn begs Varuṇa, the all‑seeing lord of law, sea and sky, to forgive humanity’s constant transgressions, grant mercy, and release them from death’s bonds through devoted worship.",
  "1026": "A vibrant plea to Agni, the youthful priest‑god, asks him to don his sacred robes, accept the offering, and join the divine fellowship of fire‑blessed deities, so that the sacrifice and hymns may bring prosperity,",
  "1027": "A fervent prayer to Agni asks the fire‑god to protect the worshippers, grant them strength and blessings, and carry their offerings and praises to the gods.",
  "1028": "A vivid hymn urges the mighty Indra to eagerly drink the Soma pressed from the mortar, praising the stone, pestle, cords, and other sacrificial tools that crush and filter the sacred juice for the god’s consumption.",
  "1029": "A pleading chant to Indra asks the mighty god to grant abundant horses and cattle, silence enemies, calm chaos, and protect the supplicant despite their hopelessness.",
  "1030": "A fervent prayer to Indra, the thunder‑wielding, Soma‑drinking lord of countless powers, begs his mighty aid, abundant feasts, and protective strength for the singers and their community.",
  "1031": "The hymn praises Agni as the original divine seer and fire‑god who births the Maruts, carries the priest’s offerings, protects and enriches humanity, and serves as the ever‑watchful father‑figure guiding mortals toward wealth,",
  "1032": "Indra, the thunder‑wielding hero, slays the dragon Vṛtra, releases the floodwaters, drinks the sacred Soma, and establishes his unrivaled rule over all beings and realms.",
  "1033": "A bold hymn urges warriors to call on Indra, the thunder‑wielding god of wealth and victory, to smash enemies, seize cattle and treasure, and grant perfect knowledge and protection to his faithful followers.",
  "1034": "A prayer to the twin divine horsemen asks them repeatedly—three times in day and night, three times in sacrifice, three times for wealth, health and protection—to ride their triple‑wheel chariot, bring abundant food, medicine and prosperity,",
  "1035": "A vibrant hymn invokes the sun‑god Savitar, alongside Agni, Mitra, Varuṇa and Night, to drive away darkness, illness and evil, illuminate the world, guide souls and grant prosperity and protection.",
  "1036": "A vibrant hymn hails Agni as the powerful, divine fire‑messenger who carries offerings, grants strength and wealth, defeats enemies, and protects humanity, urging him to blaze ever brighter for the gods and mortals alike.",
  "1037": "A rousing hymn calls on the Kaṇvas to celebrate the mighty, thunder‑clad Maruts—storm‑born warriors who ride with shining weapons, shake mountains, rain down clouds, and inspire awe and devotion among their followers.",
  "1038": "A vivid plea calls on the storm‑god Maruts—Rudra’s mighty, wind‑blowing sons—to unleash life‑giving rain, protect humanity from plague and drought, and be honored with song and reverent praise.",
  "1039": "The hymn urgently calls the storm‑god Maruts, the earth‑shaking Rudras, to unleash their fierce, lightning‑fast power to crush any enemy and protect the frightened Kaṇva with divine, unstoppable strength.",
  "1040": "A prayer to Brahmanaspati and the gods asks for their swift aid, wealth, heroic strength, and lasting fame for the devotee who offers sacred gifts, so that he may become an unstoppable, thunder‑wielding champion celebrated by",
  "1041": "A person protected and enriched by the gods Varuṇa, Mitra, Aryaman and the Ādityas enjoys invincible prosperity, safe passage through trouble, abundant wealth and offspring, and must honor these deities with proper sacrifice and",
  "1042": "A prayer to Pūṣan asks the divine guide to clear obstacles, drive away wolves and thieves, bless the journey with safety, prosperity and nourishment, and grant easy riches and fertile pastures.",
  "1043": "We ask the mighty, wise Rudra—lord of sacrifice, hymns, healing and radiant as the sun—to bless our people, cattle, and offspring with health, strength and prosperity, invoking all the gods together so that Soma’s glory and",
  "1044": "At dawn the hymn hails the immortal fire‑god as the radiant messenger who carries offerings, summons the waking deities, and grants strength, fame and long life to those who honor him.",
  "1045": "A vibrant hymn calls on Agni to gather and honor the whole pantheon—Vasus, Rudras, Ādityas, and other divine ancestors—by hearing the prayers, receiving offerings, and leading the sacred Soma feast for all",
  "1046": "At dawn the hymn hails the twin Aśvins—sun‑rising, sea‑born saviors who ride fiery chariots, drink Soma, and grant light, protection and wealth to those who honor them with sacrifice.",
  "1047": "The hymn urges the twin divine horsemen, the Aśvins, to accept the offered sweet Soma, ride their radiant three‑horse chariot to the worshippers, and grant wealth and protection to those who honor them.",
  "1048": "A vibrant hymn hails Dawn, the sky‑born goddess Uṣas, as the radiant bringer of light, wealth, and life who awakens all creatures, drives chariots of steeds and cattle, and grants prosperity, protection,",
  "1049": "From the bright sky descends Uṣas, the dawn‑daughter, riding a shining chariot drawn by red steeds to awaken gods, nobles and all creatures, spreading light across the world as the Kaṇvas invoke her",
  "1050": "A vivid hymn praises the all‑seeing Sun god, whose radiant chariot and seven shining steeds blaze across the sky, dispelling darkness, guiding gods and humans alike, and is invoked to heal and protect the speaker.",
  "1051": "A vibrant hymn celebrates Indra as the mighty, thunder‑wielding savior who defeats demons, frees prisoners, bestows wealth and protection, and inspires joyous songs and feasts among gods and humans alike.",
  "1052": "A triumphant hymn celebrates Indra’s thunderous victory over the rain‑blocking dragon Vṛtra, praising his mighty strength, divine helpers, and the life‑giving rains he unleashes for humanity.",
  "1053": "A vibrant hymn glorifies Indra as the mighty, generous protector who bestows wealth, cattle, and victory over foes, urging him to grant abundant food, strength, and prosperity to his grateful worshippers.",
  "1054": "A fervent plea urges the mighty Indra—depicted as a thunder‑roaring, bull‑strong champion who shatters heavens, defeats demons, frees rivers, and bestows wealth and protection—to spare the singers from battle and grant",
  "1055": "Indra, the mighty bull‑like warrior‑god who dominates heaven and earth, wields a thunderbolt, drinks Soma, bends mountains, commands storms and battles, and is praised as the supreme source of strength and protection for humanity.",
  "1056": "A triumphant hymn celebrates Indra’s heroic deeds—riding swift golden chariots, drinking Soma for strength, crushing the serpent Vṛtra, releasing rain and freeing waters, and inspiring victorious, dust‑free battle glory.",
  "1057": "A hymn glorifies Indra as the boundless, thunder‑wielding lord whose generous, flood‑like bounty empowers all beings, commands worship, and shatters clouds, urging the faithful to offer reverent praise and seek his victorious",
  "1058": "A vivid hymn praises Agni, the ever‑bright, unstoppable fire‑messenger of the gods, as the powerful, ever‑renewing herald who rushes through wood and sky, grants riches and protection, and serves as the essential,",
  "1059": "The hymn glorifies Agni‑Vaiśvānara as the central, radiant fire that links heaven and earth, sustains humanity, defeats enemies, and is praised as the supreme, ever‑bright messenger and protector of both gods and people",
  "1060": "A vibrant hymn praises Agni, the swift, treasure‑bearing priest‑god who awakens before dawn to protect households, guide sacrifices, and fulfill the yearning of both gods and humans.",
  "1061": "A vibrant hymn glorifies Indra as the mighty, thunder‑wielding hero who slays the dragon Vṛtra, releases the waters, and rewards worshippers with triumph and bounty.",
  "1062": "A vibrant hymn celebrates Indra’s mighty deeds—splitting mountains, releasing cattle, driving away darkness, shaping rivers and earth, and inspiring endless devotion from singers, heroes and wives alike.",
  "1063": "A powerful, thunder‑wielding Indra is praised for terrifying gods and monsters, crushing foes and castles, protecting warriors like Kutsa and Sudās, opening race‑courses, providing abundant food, and granting wealth to those who invoke him",
  "1064": "A vivid hymn praises the fierce, rain‑bringing Maruts—Rudra’s mighty, thunder‑clad offspring who roar like lions, wield bright lances, flood the earth with milk‑like rain, and grant warriors invincible strength",
  "1065": "A lone, wise seeker follows a hidden, divine thief who bears a sacred offering to the gods, prompting a cosmic gathering where waters nurture a noble newborn, fire trims the earth, and a swan‑like sage, radiant as Soma, awak",
  "1066": "A vivid hymn celebrates the divine as a radiant, life‑giving force—bright as the sun, swift as a bird, nurturing like a mother cow, powerful as a conquering warrior, and ever‑present in both present and future, urging",
  "1067": "A triumphant, king‑like priest of fire who commands the cosmos, protects cattle, sustains life, and grants wealth to those who honor him with sacred rites.",
  "1068": "A restless, supreme deity who rises to the sky, creates night and all life, governs law and wealth, blesses worshippers with children and prosperity, and adorns heaven with stars.",
  "1069": "A vivid hymn praises Agni as the radiant, divine fire‑god who fills the worlds with heavenly light, nourishes and protects humanity, and stands beside heroes and dawn‑loving deities as the humble yet mighty source of blessing and power",
  "1070": "A prayerful plea asks the all‑seeing fire‑god to bless humanity with abundant food, protect both divine and mortal realms, and reward those who honor him with songs, wealth and victory.",
  "1071": "A vivid hymn praises Agni as the radiant, nurturing fire that guides and protects humanity, creates order, fuels sacrifice, and links mortals with the divine realm, urging reverence and protection against age and adversity.",
  "1072": "Agni, the ever‑generous fire‑lord, is praised as the hidden yet supreme source of all blessings, guiding mortals and gods alike toward immortal wealth, nourishment, and divine insight.",
  "1073": "A vibrant hymn praises Agni as the generous, protective fire‑god who feeds and blesses households, grants wealth, victory and long life to warriors and princes, and unites heaven and earth, urging worshippers to honor him for prosperity and",
  "1074": "A vibrant hymn celebrates Agni, the fire‑god who protects worshippers, defeats Vṛtra, carries offerings silently and powerfully to the gods, and grants strength and wealth to those who sacrifice.",
  "1075": "A vibrant hymn invokes Agni as the beloved fire‑god who carries offerings and summons the divine assembly, pleading for his friendship and aid in the sacred sacrifice.",
  "1076": "A fervent prayer asks Agni to draw near, accept the offering, protect the sacrifice from evil, and bestow wealth, children, and divine favor through his fiery power.",
  "1077": "The hymn praises Agni as the radiant, law‑upholding messenger who brings the gods to mortals, receives offerings, and grants strength and prosperity to the faithful.",
  "1078": "A vibrant hymn praises Gotama as a swift, wealth‑seeking hero who defeats foes, slays Vṛtra, and inspires joyous songs to Agni, repeatedly celebrating his glorious deeds.",
  "1079": "A vivid hymn praises Agni, the radiant fire‑god who rides the sky, drives away serpents and demons, brings rain, wealth and protection, and is invoked for strength, prosperity and the success of all rites.",
  "1080": "A triumphant hymn celebrates Indra’s thunder‑armed might as he slays the dragon Vṛtra, releases the floodwaters, and revels in his unrivaled power and divine glory.",
  "1081": "The hymn passionately calls on Indra, the victorious slayer of Vṛtra, to grant strength, wealth and victory in battle, rewarding the faithful with abundant spoils and protection.",
  "1082": "A fervent hymn urges Indra, the thunder‑god, to harness his two bay steeds, bring his richly laden chariot, and join in joyous celebration with his spouse and the divine assembly.",
  "1083": "Indra’s generous aid brings a devout man and his family abundant cattle, horses and wealth, while the gods bless their sacrifices, uphold law, and celebrate their prosperity with lively praise.",
  "1084": "A fervent hymn urges the mighty Indra, empowered by pressed Soma and his swift steeds, to hear the priests’ praises, unleash his thunderbolt on foes, and generously bless humanity with his unstoppable strength and abundant gifts.",
  "1085": "The hymn celebrates the fierce, rain‑bringing Maruts—Rudra’s heroic sons who race across the sky, split clouds, drive away foes, and grant wealth and protection to those who honor them.",
  "1086": "A hymn praises the mighty Maruts as sky‑giants who protect a heroic sacrificer, bless his cattle and Soma rites, grant him strength that rivals the sun, and, with thunderbolts, vanquish darkness and demons to bring",
  "1087": "A thunderous, proud band of fierce, ornamented warriors—like shining stars and storm‑cloud birds—races across the sky wielding spears and steeds, shaking the earth, pouring rain, and claiming divine glory as they join Ind",
  "1088": "A vivid prayer calls the storm‑god Maruts, riding lightning‑charged chariots with lances and steeds, to descend with glorious food, thunderous power, and sacred libations, stirring both the earth and the worshippers’ spirits",
  "1089": "A vibrant prayer asks every deity—Bhaga, Dakṣa, Mitra, Aditi, Varuṇa, Soma, the Aśvins, Sarasvatī, the Wind, Earth, Heaven, the Maruts, Agni",
  "1090": "A prayer asks the guiding gods—Varuṇa, Mitra, Aryaman, Indra, the Maruts, Pūṣan, Bhaga, Viṣṇu, and others—to protect the law, drive away enemies, and bless",
  "1091": "The hymn praises Soma as the supreme, all‑powerful source of wisdom, vitality and wealth who guides gods and mortals, dispels darkness, protects warriors, grants prosperity and immortality, and is begged to accept the offering and bless humanity",
  "1092": "At dawn the radiant goddess, likened to bright red cows and heroic warriors, spreads her luminous banner across the sky, dispelling darkness, energizing worshippers, and promising wealth, strength, and blessings through her shining light and divine steeds.",
  "1093": "A vibrant prayer to the twin fire‑and‑drink gods Agni and Soma asks them to hear the hymn, bless the giver with strength, wealth, fertile cattle and horses, protect his rites, and grant lasting prosperity to all who honor them",
  "1094": "A vibrant hymn praises Agni as the powerful, protective fire‑god who drives the sacred chariot, purifies offerings, defeats evil, grants wealth and longevity, and secures divine favor for the worshippers.",
  "1095": "A radiant infant born of Tvaṣṭar’s ten vigilant daughters, embodying fire, water and sky, is praised as the mighty, self‑sustaining source of life, order and worship that fuels and purifies the world.",
  "1096": "A powerful, ever‑toiling fire‑god who creates and sustains humanity, wealth, and the cosmos is praised as the chief sacrificial giver, protector of earth and heaven, and source of prosperity, long life, and heroic triumph.",
  "1097": "A prayer to Agni asks his radiant fire to drive away sin, bless fields, homes and wealth, protect and guide the worshippers like a ship across danger, and ensure their prosperity and triumph.",
  "1098": "We pray that the all‑pervading Vaiśvānara, rival of the sun and present in fire, earth and every plant, may protect us day and night, bring us abundant wealth, and have his truth",
  "1099": "We invoke Jātavedas to press the Soma, devouring the evil’s riches, while Agni guides us safely through every",
  "1100": "A rousing prayer hails Indra, the thunder‑wielding king of gods, as the unbeatable, sun‑bright champion who, girded by the Maruts and his divine allies, crushes foes, secures treasure, water",
  "1101": "A vibrant hymn praises Indra, the thunder‑god girded by the Maruts, as the mighty protector who drives away darkness, defeats foes, upholds cosmic law, and grants blessings to those who offer him solemn oblations.",
  "1102": "A rousing hymn hails Indra as the unbeatable war‑god who drives his victorious chariot, spreads glory across the heavens and rivers, and is begged to protect and empower his worshippers in every battle, granting them spoils and joy",
  "1103": "Indra, the mighty thunder‑god, is praised for spreading and fixing the earth, slaying serpents and demons, conquering foes and fortresses, and bestowing wealth and protection on the Aryas, prompting all gods and divine beings",
  "1104": "A pleading hymn urges Indra to swiftly arrive, protect the people from hostile forces, grant them prosperity, safety, and nourishment, and bless their offspring, while offering him soma as a token of devotion.",
  "1105": "A plaintive hymn repeatedly cries “Mark my woe, Earth and Heaven” as the speaker laments cosmic disorder, seeks divine law and protection, and urges the gods—especially Agni, Varuṇa, and the celestial forces—to restore",
  "1106": "A fervent plea calls on every deity—Indra, Mitra, Varuṇa, Agni, the Maruts, Aditi, the Vasus, the divine fathers and mothers, Narāśaṁsa, Pūṣan,",
  "1107": "A prayer asks the gods—especially the Ādityas, Indra, Maruts, Varuṇa, Agni, and others—to favor and protect the worshippers, granting them shelter and acceptance through their sacred songs.",
  "1108": "A vibrant hymn invites the united forces of Indra and Agni to share the sacred Soma, praising their heroic deeds and friendship while urging them from every realm—earth, sky, water, and fire—to drink, bless the worshippers, and",
  "1109": "A desperate devotee pleads to the combined power of Indra‑Agni, invoking their thunderous might, past victories, and generous wealth to protect and bless the worshippers with prosperity and victory.",
  "1110": "A vibrant hymn praises the divine Ṛbhus—sons of Sudhanvan who, after a long journey, receive immortality from Savitar, multiply the sacred chalice, revive their parents, and bestow strength, wealth, and protection",
  "1111": "The hymn praises the skilled Ṛbhus for creating divine chariots, rejuvenating life, and providing powerful, prosperous aid through the gods, asking them to grant the singers lasting wealth, wisdom, and victorious strength in battle.",
  "1112": "The hymn fervently invokes the twin divine heroes, the Aśvins, praising their countless miraculous deeds—granting aid, healing, victory, fertility and protection to gods and mortals alike—and begging them to come swiftly, empower the supplicant",
  "1113": "The hymn celebrates the radiant Dawn as the victorious, ever‑renewing goddess who drives away night, awakens all life, bestows wealth and worship, and continually renews the world’s light and blessings.",
  "1114": "A heartfelt plea to the fierce, braided‑haired Rudra, asking his protective, healing and benevolent power to keep the village’s people, cattle and heroes safe, well‑fed and joyful while offering reverent worship and gifts.",
  "1115": "The hymn celebrates the radiant Sun‑god Sūrya, whose brilliant horses pull his chariot across sky and earth, linking the divine eyes of Mitra, Varuṇa and Agni with the cycles of day and night, and impl",
  "1116": "A vivid hymn celebrates the divine twins’ swift, horse‑driven miracles—rescuing heroes, restoring sight, delivering riches, taming seas, reviving the dead, and granting health and prosperity to countless mortals.",
  "1117": "A vibrant hymn hails the swift, miracle‑working twin gods Asvins as generous rescuers who, riding a divine chariot, bring life, health, wealth and protection to countless mortals—saving sages, reviving the blind, delivering",
  "1118": "The hymn calls the swift, triple‑charioted twin gods, the Asvins, to race down on falcon‑wings and bring healing, strength, and gifts to humans—restoring milk, sight, youth, horses and",
  "1119": "A vibrant hymn celebrates the swift, banner‑adorned chariot of the divine twins as they race across the world delivering gifts, rescuing heroes, reviving sages, and granting victories and blessings to all who honor them.",
  "1120": "A prayer to the twin divine riders asks them to reveal how the ignorant may worship, to protect the faithful from danger, to bless them with wealth, cattle and food, and to grant swift, ever‑lasting prosperity through their sacred chariot.",
  "1121": "A vivid hymn praises Indra’s heroic deeds—slaying Vṛtra, releasing cattle, hurling thunderbolts, and granting wealth, milk, and victorious chariots to the Angiras’ people—so they may feast,",
  "1122": "A vivid hymn invokes a host of gods—Rudra, Indra, the Maruts, Dawn, Sun, Wind, Mitra‑Varuṇa, Agni and others—to bless a grand sacrificial feast, praising generosity, heroic vigor",
  "1123": "A vibrant hymn celebrates Dawn’s radiant chariot as the divine, ever‑young goddess who drives away darkness, brings light and wealth to homes, and renews the world’s order with each daily triumph.",
  "1124": "A vivid hymn celebrates Dawn as the radiant, ever‑renewing goddess who awakens the world, orders the heavens, drives labor and prosperity, and blesses humanity with light, wealth and joyful renewal.",
  "1125": "A generous, early‑rising benefactor who offers treasure, drink, and praise to the gods and his followers is promised abundant wealth, vitality, and lasting honor, while those who hoard are warned of decline and suffering.",
  "1126": "A boastful speaker thanks a powerful patron for lavish gifts—sacrifices, horses, chariots, and countless cattle—celebrating the king’s unstoppable glory and the speaker’s own joyous, richly adorned status.",
  "1127": "The hymn praises Agni as the radiant, ever‑watchful fire‑god who carries offerings to the divine, defeats demons, fuels rituals, and grants strength, wealth and protection to all who invoke him.",
  "1128": "A hymn praises Agni as the divine priest born by Manu’s law, the ever‑watchful fire‑messenger who carries offerings, grants wealth and protection, and sustains all sacrificial rites across earth and heaven.",
  "1129": "A fervent prayer calls on Indra to swiftly bring his powerful, rain‑driving chariot near, crush enemies, protect the faithful, and grant wealth and victory in battle.",
  "1130": "A vibrant plea to Indra urges the mighty storm‑god to descend from the heavens, drink the Soma offering, unleash his thunderbolt and flood‑like power to crush enemies, reveal hidden riches, and grant strength and prosperity to his worshippers",
  "1131": "A fervent hymn praises Indra as the supreme, lightning‑wielding protector who grants victory, wealth and light to his worshippers, demanding libations and praise while crushing foes and blessing those who call upon his mighty strength.",
  "1132": "A rousing plea to Indra to pour Soma, grant victory, split the spoils, and drive away all enemies in a fierce, celebratory war sacrifice.",
  "1133": "A fierce hymn calls on Indra to smash sorceresses and demons with thunderous force, celebrating his violent victories and the lasting wealth he grants to those who offer generous libations.",
  "1134": "A vibrant hymn calls on the swift wind‑god Vāyu, urging his chariot‑drawn steeds to bring the first Soma offering, bless the ritual with radiant dawns, flowing milk and divine power, and protect the worshippers from",
  "1135": "A vibrant hymn invites the wind‑god Vāyu (and Indra) with his mighty, horse‑drawn chariot and countless attendants to join the sacred feast, drink the first drops of purified, stone‑pressed Soma, and bless",
  "1136": "A vibrant hymn invokes the watchful twin deities and the generous celestial lords—Mitra, Varuṇa, Aryaman, and the Aditi—offering sweet Soma and prayers for protection, prosperity, and lasting praise from kings and",
  "1137": "A ritual chant urges the heavenly kings Mitra and Varuṇa to come and drink the freshly pressed, milk‑mixed Soma juice, celebrating its bright, curd‑laden offering as the sun rises.",
  "1138": "A vibrant hymn hails the swift, generous god Pūṣan as a powerful, benevolent protector who drives away foes, grants wealth and wisdom, and rewards his faithful singers with friendship and triumph.",
  "1139": "A fervent prayer invokes Agni, Indra, Vayu, and the eleven celestial deities, praising their power, chariots, and gifts while offering Soma and other sacrifices to secure their blessings, wealth, and eternal glory.",
  "1140": "A vivid hymn praises Agni, the fire god who nourishes and protects humanity, drives the sun’s chariot, devours darkness, revives the dead, fuels prosperity and long life, and is implored to bless the people with wealth",
  "1141": "A vivid hymn celebrates the radiant fire‑god’s birth, power and nourishment—born from strength, dwelling in sacrifice, feeding the world, guiding chiefs and worshippers, and granting wealth, protection and divine favor.",
  "1142": "A vibrant hymn calls Agni to kindle the fire and summon the gods—especially Indra—while priests, singers, and nature’s forces unite in a richly described sacrifice of soma, mead, grass and gifts, seeking divine presence, blessing",
  "1143": "A vibrant hymn praises Agni, the fiery son of water and strength, whose blazing power illuminates heaven and earth, drives away darkness, protects and nourishes the faithful, and grants wealth and success to those who invoke him.",
  "1144": "A priest invokes the fire god, describing his powerful, radiant sacrifice that unites divine law, water and horse‑driven strength, and calls on Agni’s bright, self‑sustaining energy to bless and sustain the world.",
  "1145": "A wise, powerful sage—embodied as a victorious, ever‑moving force who commands strength, imparts ancient law, and inspires joy—answers all questions, guides sacrifice, and drives humanity forward.",
  "1146": "A vibrant hymn praises the radiant, triple‑headed fire‑god who, born of his parents and ever‑young, spreads his red flames across earth and sky, guiding sages, nourishing cattle, and becoming the universally visible source of life and wealth",
  "1147": "A prayer to Agni asks the fire god to empower the faithful, protect the righteous, punish the deceitful, and ensure that his worship brings joy and safety to all who honor him.",
  "1148": "A vivid hymn praises the fiery, ever‑moving spirit of Mātariśvan—Agni—who, born of friction and shining like bright light, drives chariots, devours wood, and protects worshippers who honor him.",
  "1149": "A radiant, double‑born deity who swiftly brings wealth, guides both earth and heaven, lights the sacred palace, and rewards generous worshippers with noble offspring.",
  "1150": "Calling on Agni, the ever‑ready fire‑god who aids only the diligent, the hymn praises his faithful servants and urges them to become foremost worshippers of his radiant, heavenly power.",
  "1151": "A powerful hymn celebrates the divine helpers who shake heaven and earth, grant strength to singers, receive gifts and sacrifices, and bless humanity with mighty, life‑giving force.",
  "1152": "A vivid hymn praises Mitra‑Varuṇa’s boundless power and law‑upholding might, celebrates the unborn babe who bears the world’s burden, invokes divine love, protection and rain, and urges victorious worship and offerings.",
  "1153": "A hymn praises the twin deities Mitra‑Varuṇa, invoking oil‑smeared priests, offerings, and the nourishing milk of the cosmic cow to secure their blessings and joyful abundance for worshippers.",
  "1154": "A vibrant hymn celebrates Vishnu’s colossal, triple‑stepped stride that measures and upholds the world, describing his vast, mountain‑dwelling realm as a wondrous, sweet mansion where all beings find shelter and joy.",
  "1155": "A vibrant hymn celebrates the heroic, multi‑stepped deity who rides a noble steed, drinks Soma, commands Indra and Vishnu, bestows strength on mortals, and traverses the heavens and earth in awe‑inspiring,",
  "1156": "A hymn glorifies Vishnu as the radiant, oil‑fed protector who, like Mitra, bestows order, wealth and divine law, receives gifts and praise, and together with his consort and allies such as Varuna, the Ash",
  "1157": "The hymn awakens the sun and dawn, calls on the twin horse‑men Aśvins to bring their shining chariot, honeyed oil, food, healing and victory in battle, and asks them to grant long life, protect against",
  "1158": "A prayer to the powerful Vasus and Rudras asks them to protect and enrich the speaker, invoking mythic imagery of divine aid, heroic journeys, and cosmic forces to secure safety, wealth, and lasting honor for his lineage.",
  "1159": "A hymn celebrates the divine parents who, through sacred sacrifice and wisdom, created the world and its immortal offspring, uphold truth, weave cosmic order, and bestow abundant blessings upon humanity.",
  "1160": "A hymn praises the cosmic pair of Heaven and Earth as nurturing parents who created and sustain the world, the sun, and all beings, granting prosperity, protection, and divine authority to the priest‑king who upholds order and receives their blessings.",
  "1161": "A mythic dialogue describes the arrival of a divine messenger and the ritual tasks—crafting chariots, cows, and cups—performed by the skilled Ṛbhus and Sudhanvan’s sons to honor the gods, culminating in a",
  "1162": "A vivid ritual hymn petitions the gods that a richly adorned sacrificial horse, accompanied by a goat and all its gear, be flawlessly prepared, offered, and blessed to bring wealth, offspring, and divine favor.",
  "1163": "A vivid hymn celebrates the divine, celestial horse—born from sea and sun, linked to gods like Yama, Indra, and the Vasus—describing its majestic, winged form, sacred harness, and role as a powerful,",
  "1164": "A sprawling, symbolic hymn weaves together countless images of gods, wheels, cows, birds, and numbers—especially seven—to portray the mysterious, ever‑turning cosmic order that sustains and connects all realms, beings, and rituals.",
  "1165": "A vibrant hymn calls the storm‑god Maruts and mighty Indra to reveal their origins, purpose, and heroic deeds, praising their thunderous power, wealth‑loving vigor, and the blessings they bestow on worshippers through fierce battles",
  "1166": "A vibrant hymn praises the thunder‑riding Maruts as powerful, benevolent protectors who, with fire and lightning, crush foes, bless sacrifices, scatter wealth and milk, guard the faithful, and ensure abundant food and prosperity for humanity.",
  "1167": "A vibrant hymn praises Indra and the mighty Maruts, invoking their countless aid, wealth, protective boons, heroic steeds, and divine companionship to bring abundant riches, food, and victorious strength to their followers.",
  "1168": "A vivid hymn praises the powerful, lightning‑armed Maruts as divine, sky‑borne warriors who thunder across the heavens, crush obstacles, bring rain and abundance, and inspire humans to sing for their strength and generous gifts.",
  "1169": "A vibrant plea to Indra asks him, with the fierce Maruts at his side, to protect the faithful, grant victorious battle spoils, abundant riches and food, and shower the world with his powerful, benevolent blessings.",
  "1170": "A desperate plea to Indra and the Maruts asks why they threaten humanity, urges peace and shared sacrifice, and calls on the gods of wealth and friendship to listen, cooperate, and bless the offering.",
  "1171": "A devout prayer begs the storm‑god Maruts for their favor, peace and protection—asking them to calm their wrath, bless the speaker’s days with triumph, and provide abundant strength—while also pleading with Indra to cease his anger",
  "1172": "The hymn pleasently begs the generous, lightning‑fast Maruts to spare humanity from their fierce, stone‑hurling power and instead lift us up so we may live.",
  "1173": "A vibrant hymn calls on Indra, the mighty thunder‑god and war‑leader, to hear the fervent praises and offerings of priests, youth, and worshippers—celebrating his power, his steeds, his protective role for cattle",
  "1174": "A vibrant hymn hails Indra as the supreme, battle‑winning king who crushes hostile tribes, tames floods, protects heroes and fields, and grants abundant victory and prosperity to his people.",
  "1175": "A vivid hymn hails Indra’s unstoppable power and victorious feasting, praising his mighty drink, storm‑driven steeds, sun‑stealing might and triumph over enemies while invoking abundant nourishment for his worshippers.",
  "1176": "A fervent prayer to Soma asks the divine drink to empower Indra, strike down enemies, reward the generous, and ensure abundant nourishment for the worshippers.",
  "1177": "A vibrant hymn urges the mighty, horse‑driven Indra—called the “Bull of men”—to descend, accept the sacrificial offerings and Soma, and grant the singers swift aid and abundant nourishment.",
  "1178": "A prayer to Indra asks the god to hear and reward the singers’ praise, grant victory, protect the people, and provide abundant strength and food.",
  "1179": "A weary speaker laments aging and unfulfilled vows, urges spouses to reunite, calls for divine favor in love, labor and competition, and seeks forgiveness and blessings for children, power, and spiritual fulfillment.",
  "1180": "A vibrant hymn celebrates the swift, shining twin horse‑riders who traverse the sky in a radiant chariot, bringing rain, milk, fire‑offerings and protection to humanity, and urging them to grant abundance, strength and divine favor.",
  "1181": "A vivid hymn praises the twin divine horsemen, the Aśvins, invoking their swift, rain‑driven chariots, powerful steeds, and nourishing gifts to protect humanity, bring wealth, and flood the world with life‑giving",
  "1182": "A vivid hymn calls on the swift, divine twins to bring their chariot of sweet offerings, rescue the fallen son of Tugra from the sea, defeat foes, and bless the worshippers with wealth and abundance.",
  "1183": "A vivid prayer urges the swift, three‑wheelled, triple‑seated divine twins—who fly like birds, bring dawn’s light, protect against wolves, and grant abundant nourishment—to descend in their shining chariot, bless the worshippers",
  "1184": "A lively prayer calls the divine twins to bless the dawn, bring joy, strength and abundant nourishment, and guide the faithful along the sacred paths of the gods.",
  "1185": "A prayer to the twin cosmic parents—Day and Night, Heaven and Earth—asks them to reveal their mysterious origins, sustain all life, protect humanity from danger, and grant abundant nourishment and divine favor.",
  "1186": "A vibrant hymn invites the sun‑god Savitar and a host of deities—Agni, Varuṇa, Indra, the Maruts, the Aśvins, and others—to bless the gathering with youthful joy, abundant nourishment",
  "1187": "The hymn praises food as a life‑giving, heroic force that fuels divine victories, nourishes bodies and spirits, and invites its abundant, wholesome presence to sustain both gods and humans.",
  "1188": "A vibrant hymn celebrates the fire‑god’s radiant power, calling on divine messengers, sages, and nature spirits to bless a grand sacrifice of meat and drink, invoking countless gifts, heroic honor, and the flourishing of all life.",
  "1189": "A prayer to Agni asks the fire‑god to cleanse sin, protect the faithful from danger and disease, bless their homes and offspring, and grant them wealth, food and lasting prosperity.",
  "1190": "Praise Bṛhaspati as the mighty, sweet‑tongued chief of song whose radiant wisdom and boundless generosity flood the world like a bright river, granting light, wealth and protection to the worthy while rebuking the foolish and",
  "1191": "A vivid plea against unseen, venomous creatures—worms, insects, reptiles and spirits—that afflict humans and animals, urging vigilance and invoking the sun, fire, rivers and divine forces to destroy the hidden poison and restore safety.",
  "2001": "The hymn glorifies Agni as the radiant, all‑encompassing fire‑god who springs from water, stone, forest and earth, fulfills every priestly role, embodies the powers of all major deities, bestows wealth, protection and",
  "2002": "A vibrant hymn praises Agni as the all‑knowing, fire‑born priest and messenger who fuels sacrifice, grants wealth and protection, and unites gods and humans in radiant, ever‑renewing devotion.",
  "2003": "A vivid hymn praises Agni as the ever‑ready, divine fire‑priest who kindles the altar, carries offerings through the heavens, summons the gods and their celestial hosts, and unites the sacred grasses, goddesses, and",
  "2004": "A vibrant hymn praises Agni, the radiant fire‑god who bridges mortals and deities, fuels sacrifice, illuminates darkness, renews strength, and grants wealth, heroism and prosperity to those who honor him.",
  "2005": "A powerful, priest‑like guardian born to guide and protect patrons, who commands sacrifice, knowledge, and divine rites with swift, bird‑like chants, overseeing rituals, offerings, and the holy forces that sustain the world.",
  "2006": "A vibrant prayer to Agni asks the fire‑god to receive the offering, bless the singers with wealth, rain and strength, drive away enemies, and act as a generous, wise messenger who unites and protects humanity.",
  "2007": "A youthful, powerful Agni is invoked to bring wealth, protect against all hostility, and clear a victorious path like a flood, praised through offerings of cattle and oil.",
  "2008": "A vibrant hymn celebrates the ever‑young, sun‑like fire‑god who drives his chariot, guides worshippers, and, with the aid of the other deities, grants strength and victory over foes.",
  "2009": "The hymn praises Agni as the radiant, ever‑watchful herald and protector who upholds law, brings wealth and blessings, and deserves reverent worship at both his lofty and humble hearths.",
  "2010": "A vibrant hymn praises Agni, the ever‑watchful fire‑god who, born of sacrifice and radiant in countless forms, receives offerings, guides prayers, and bestows wisdom, wealth, and protection to all who invoke him.",
  "2011": "A fervent plea to Indra urges the storm‑god to unleash his thunder, defeat the serpentine foes, and pour out wealth and protection on his worshippers, who promise praise, libations of Soma, and loyal service in return.",
  "2012": "A thunder‑armed champion who steadies earth, splits mountains, slays dragons, frees rivers, commands sky and sun, rewards Soma‑drinkers, and drives warriors to victory, is praised as the mighty Indra.",
  "2013": "A vivid hymn praises the mighty Indra as the creator and sustainer who tames floods, brings milk and food, spreads rivers and crops, defeats demons, lifts the lowly, and grants abundant wealth, urging him to continue bestowing his",
  "2014": "The hymn urges the priests to pour abundant Soma for Indra, celebrating his thunderous victories over foes and urging the offering as a joyous libation that honors his power and promises wealth.",
  "2015": "In a vivid, intoxicated hymn the poet celebrates Indra’s mighty deeds—drinking Soma, slaying the dragon, supporting heaven and earth, shaping rivers, crushing foes, rescuing the drowned, overturning enemies, and granting wealth to",
  "2016": "A fervent hymn praises Indra as the unstoppable, thunder‑wielding lord of strength and Soma, urging him to grant protection, wealth and victory to his worshippers who offer fire‑sacrifices and bold prayers.",
  "2017": "A vibrant hymn praises Indra’s ancient heroic feats—opening the cows’ stalls with Soma’s rapture, conquering foes, holding up heaven and earth, wielding thunderbolts, and granting wealth and blessings to those who honor him.",
  "2018": "A vivid hymn praises Indra’s magnificent, horse‑drawn chariot and abundant Soma offering, urging the god to rush forward in triumph, bless his worshippers, and grant them wealth and protection.",
  "2019": "A vibrant hymn praises Indra as the thunder‑wielding dragon‑slayer who, through the sacred Soma drink, releases floodwaters, grants sunlight, cattle and riches, defeats foes, and rewards his worshippers with prosperity and protection.",
  "2020": "A vibrant plea to Indra asks the warrior god to grant strength, protection, and abundant blessings to his devoted singers and fighters, celebrating his past victories over foes and his role as the beneficent guardian of humanity.",
  "2021": "A vibrant hymn praises Indra as the all‑powerful, ever‑victorious lord of wealth, light, animals and floods, whose heroic deeds and generous gifts of riches, safety, eloquence and good weather are secured through reverent sacrifice",
  "2022": "A mighty god, fueled by sacred drink and Soma, triumphs over chaos and enemies, bestowing strength, prosperity and protection to those who honor him.",
  "2023": "A fervent hymn hails Bṛhaspati, the supreme divine counselor and protector, imploring his radiant power to safeguard worshippers, vanquish foes, grant wealth and success, and uphold sacred law.",
  "2024": "A vibrant hymn praises Brahmaṇaspati (Bṛhaspati) as the mighty, generous patron who breaks darkness, opens wealth, drives cattle, slays foes, and grants prosperity and protection to his worshippers.",
  "2025": "A powerful, fire‑lit warrior blessed by Brahmaṇaspati conquers foes, expands his lineage and wealth, commands rivers and floods, and thrives with divine happiness.",
  "2026": "A devout warrior who offers sincere sacrifices to the chief deity gains divine courage, triumphs over foes, and receives protection and prosperity.",
  "2027": "A vibrant hymn invokes the radiant Adityas—Mitra, Aryaman, Varuna and others—to bless and protect the king and his people, granting prosperity, safety, and eternal law‑guided order while pleading forgiveness for any sins.",
  "2028": "A fervent hymn praises Varuṇa as the radiant, all‑ruling protector who sustains rivers, grants wealth and safety, forgives sins, and invites his continual friendship and guidance for a prosperous, fearless life.",
  "2029": "A pleading hymn asks the powerful gods—especially the Adityas, Varuṇa, Mitra, and the Vasus—to cleanse the speaker’s sins, grant protection, prosperity, and kindness, and to uphold justice for the worshipper and",
  "2030": "A vivid hymn praises Indra’s endless victories—his thunderbolts slaying Vṛtra and other foes, guiding rivers, protecting worshippers, and granting wealth, children, and heroic fame.",
  "2031": "A fervent prayer calls on the allied gods—Varuṇa, Mitra, the Vasus, Rudras, Ādityas, Indra, Tvaṣṭar, the Aśvins, and others—to empower",
  "2032": "A devout worshipper implores the heavens, earth and divine goddesses—Rākā, Sinīvālī, Gungū, Sarasvatī, Indrāṇī and Varuṇānī—to protect him from",
  "2033": "A fervent prayer to Rudra asks his protective, healing and heroic power to bless the singers and their descendants with health, safety, and divine favor, urging him to banish disease and enmity, grant long life, and grant his",
  "2034": "A vivid hymn hails the fierce, rain‑bringing Maruts—Rudra’s thunderous sons who roar like beasts, ride storm‑clouds and golden‑armed steeds, bless cattle and crops, protect worshippers from foes, and",
  "2035": "A vivid hymn praises the radiant Son of Waters—god‑like, golden, and nourished by floods, maidens, and sacred offerings—as the creator and protector who sustains the world, inspires worship, and grants strength to princes and heroes",
  "2036": "A vivid hymn urges Indra and the priests to drink the sacred Soma, praising its strength‑granting power and inviting gods, kings, and worshippers to partake in the ritual feast.",
  "2037": "A priestly chant urges the wealth‑granting deity to drink Soma from the hotar’s cup, praising his strength, generosity, and the ritual feast of meat and offerings that sustain the gods and their heroic chariot.",
  "2038": "A vibrant hymn praises Savitar, the ever‑watchful sun‑god who energizes priests, commands the elements, orders the cosmos and all creatures, and bestows wealth and blessings on those who honor him.",
  "2039": "A vivid plea calls the twin divine heroes to arrive swiftly and protect the worshippers in every way—like paired forces of nature, tools, and body parts—so they may guide, sustain, and bless the community.",
  "2040": "A vibrant hymn praises the twin deities Soma and Pūṣan as the universal parents who banish darkness, drive the cosmic chariot, bless the land with abundance, and empower thought and heroism.",
  "2041": "A vibrant hymn summons the wind‑god Vāyu, Indra, the Aśvins, Rudras and other divine forces with chariots of fire to share the sacred, milk‑mixed Soma, seeking their protection, blessings,",
  "2042": "A prophetic bird’s cry is invoked to announce good fortune and protect the community from danger, urging loud, heroic proclamation of auspicious news.",
  "2043": "A bird, likened to a skilled chanter and priest, sings hymns of praise and good fortune at libations, spreading blessings and kind thoughts in every direction.",
  "3001": "A vivid hymn praises Agni as the radiant priest‑fire who unites heaven and earth, fuels sacrificial rites, spreads life‑giving light and wealth, and guides humanity with divine wisdom and protective power.",
  "3002": "A vibrant hymn praises Agni, the ever‑young fire‑god who carries offerings, lights the heavens, grants strength, wealth and protection, and serves as the divine priest and friend of humanity.",
  "3003": "The hymn glorifies Agni, the radiant fire‑god who bridges earth and heaven, carries offerings, upholds divine law, empowers priests and worshippers, and is praised as the essential, ever‑vigilant source of joy, strength",
  "3004": "A vivid hymn calls on Agni to kindle the fire, bring the gods, and bless the ritual with rich offerings, sacred grass, and divine presence, celebrating the harmonious work of priests, deities, and humanity in a joyous, orderly sacrifice",
  "3005": "A vibrant hymn celebrates Agni as the radiant, all‑protective fire‑god who awakens at dawn, opens darkness, links heaven and earth, guards rituals and nature, and grants wealth and offspring to his worshippers.",
  "3006": "A fervent hymn praises Agni as the divine fire‑priest who carries oil‑filled ladles eastward, spreads his seven‑tongued flames across heaven and earth, unites all gods, blesses families with wealth and offspring,",
  "3007": "A vivid hymn celebrates the cosmic dance of divine parents, celestial steeds, bulls and cows, and the fire‑god’s generous gifts, urging the priest to invoke these forces so that order, wealth and offspring may flourish.",
  "3008": "A prayer to the forest lord asks him to rise, bless the sacrificers with wealth, fertility and victory, and empower the sacred stakes and rituals that bind gods, nature and humanity together.",
  "3009": "The hymn praises Agni, the fire‑god who descends from the heavens to aid humanity, protects sacrifices, spreads light and warmth, and is revered by countless worshippers as the ever‑youthful, benevolent friend and priest of",
  "3010": "Agni, the divine fire‑priest who carries offerings to the gods, is praised as the ever‑watchful guardian, purifier and source of heroic strength who fuels sacrifice, law and prosperity for all who honor him.",
  "3011": "Agni, the swift and eternal priest‑fire, carries offerings, guides rituals, protects and empowers humanity, and is hailed as the divine source of prosperity and happiness.",
  "3012": "A vibrant hymn urges the combined power of Indra‑Agni to drink the sacred juice, perform the awakening rite, defeat enemies, and bestow abundant blessings and heroic strength through sacrificial song.",
  "3013": "A powerful hymn praises Agni as the supreme fire‑god who brings wealth, protection and blessings, guides rituals, and generously fuels the community with prosperity, children and nourishment.",
  "3014": "A priest praises the powerful fire‑god Agni, describing his radiant, lightning‑driven presence, his role in sacrifice and cosmic order, and implores him to bless and protect the worshippers with abundant wealth and divine aid.",
  "3015": "A vibrant prayer to Agni, the radiant fire‑god, asks him to banish foes, guide and protect the worshippers from dawn to dusk, grant wealth, victory and abundant blessings, and nurture their lineage.",
  "3016": "A powerful, prosperous Agni is praised as the source of wealth, heroic strength, abundant offspring, and protection, and is begged to grant riches, cattle, victory over enemies, and continual blessings.",
  "3017": "A fiery, oil‑clad priest‑like Agni is invoked to carry offerings, summon the gods, and ensure a successful sacrifice that sustains life and grants favor.",
  "3018": "A prayer to Agni asks the fire‑god to be a benevolent protector who burns away enemies and ignorance, fuels the worshipper’s offerings, and grants abundant wealth, strength and beauty to those who serve him.",
  "3019": "A vibrant prayer calls on Agni, the swift and all‑knowing fire‑priest, to receive the offering, grant strength, wealth and offspring, and lead the gods’ assembly in bestowing glory and blessings.",
  "3020": "At dawn the priest summons Agni and the sunrise deities, invoking their threefold power and many names to protect the sacrifice and guide the faithful through all troubles.",
  "3021": "A priest invokes Agni, the divine fire, offering rich drops of oil and fat as a sacred gift to please the gods and ensure a successful sacrifice.",
  "3022": "A fiery deity who carries the sacred Soma within, conquers foes, spreads light across sky, earth, water and air, summons gods and waters, accepts pure sacrifice, and promises wealth, cattle and offspring to his worshippers.",
  "3023": "A vibrant hymn hails Agni as the life‑giving, ever‑present fire of sacrifice—born of divine lineage, sustaining food, wealth and offspring, and shining over earth, rivers and people.",
  "3024": "A fiery plea to Agni to vanquish enemies, bless the worshipper with wealth, offspring and honor, and joyfully receive the sacrificial offering.",
  "3025": "A fiery, all‑knowing deity, born of sky and earth, is praised as the wise bringer of strength, food and divine presence who lights heaven and earth, summons the gods to the sacrifice, and powers the sacred gathering.",
  "3026": "A vibrant hymn calls on the fire‑god Agni—also called Vaiśvānara, Mātariśvan, and the son of Rudra—along with the storm‑powerful Maruts, to bless the worshippers with",
  "3027": "A vibrant hymn praises Agni, the fire‑god who carries sacrificial offerings skyward, grants divine blessings, empowers warriors, and is invoked with reverent chants and ritual ladles as the radiant, powerful conduit between humans and the heavens.",
  "3028": "A fervent prayer urges the all‑knowing fire god, youthful and mighty, to accept the freshly prepared sacrificial cakes offered at dawn, midday and the third libation, trusting his wisdom to carry the gifts to the immortal deities.",
  "3029": "A vivid ritual chant describes how priests ignite and honor Agni—using friction‑made fire, sacred chants, and offerings—to invoke the divine messenger who carries sacrifices, grants prosperity, and defeats enemies, all while celebrating his birth, power, and",
  "3030": "A rousing hymn praises Indra as the mighty, thunder‑wielding savior who slays Vṛtra, drives away enemies, blesses his worshippers with abundant cattle, wealth and protection, and commands the heavens, earth and",
  "3031": "A vivid hymn celebrates Indra’s heroic deeds—slaying Vṛtra, driving cattle, granting wealth, and inspiring warriors and priests through fire, song, and sacred order—while praising his divine lineage, protective power, and the joyous,",
  "3032": "A vibrant hymn urges the thunder‑wielding Indra to drink the sacred Soma, praising his heroic deeds, boundless strength, and the divine support that fuels his victories over Vṛtra and all foes.",
  "3033": "A vivid hymn urges the swift, mother‑like rivers Vipāś and Sutudri, freed by Indra’s thunder and likened to nurturing cows, to rush together toward the ocean, granting safe passage and prosperity to the traveling warriors and",
  "3034": "A vibrant hymn celebrates Indra as the mighty, lightning‑wielding lord who defeats demons, secures treasure and sunlight, commands heaven and earth, and brings joy and protection to both gods and humans.",
  "3035": "A vivid plea urges the storm‑god Indra, mounted on swift bay horses, to rush to the ritual, drink the offered Soma, feast on the prepared grain and libations, and grant his victorious aid in battle.",
  "3036": "A fervent prayer urges the mighty Indra, celebrated for slaying Vṛtra and drinking sacred Soma, to accept the offered libations and grant the worshippers abundant strength, wealth, and heroic blessings.",
  "3037": "A fervent plea to Indra, the thunder‑armed lord of countless powers, asks him to slay the serpent Vṛtra, grant victory and riches in battle, and bless the singers with everlasting glory.",
  "3038": "A vivid hymn celebrates the cosmic craftsman‑king who, like a swift horse and shining bull, orders the heavens and earth, summons wise sages and heroic gods, and bestows radiant, protective blessings upon all creation.",
  "3039": "A fervent hymn praises Indra as the mighty, light‑bringing savior who defeats darkness and Vṛtra, protects cattle, and grants wealth and safety to his worshippers.",
  "3040": "A vibrant plea urges the mighty Indra, slayer of Vṛtra, to drink the sacred Soma, granting strength and wealth to the worshippers and blessing their sacrifice.",
  "3041": "A priest summons Indra, the thunder‑armed, to the ritual feast, offering soma, cakes and hymns while urging his swift horses to bring him to the grass‑strewn altar for a joyous libation.",
  "3042": "A lively hymn urges the warrior god to drink the freshly pressed, barley‑and‑milk Soma offering, praising his strength and wealth while imploring his blessing.",
  "3043": "A fervent prayer urges the war‑god on his swift chariot and bay‑ridden steeds to rush to the sacrifice, granting protection, wisdom, and lasting wealth to the supplicant and his people.",
  "3044": "A vivid hymn praises Indra’s golden chariot, his radiant steeds, and the glowing Soma extracted from tawny stones, celebrating his power to illuminate the world and bring abundant nourishment.",
  "3045": "Summon Indra on his dazzling, peacock‑tailed steeds to smash foes, flood the enemy, and shower us with swift, abundant wealth and power.",
  "3046": "A powerful, ever‑young Indra, the thunder‑wielding sovereign who conquers, gathers spoils and commands the cosmos, is praised as the ultimate source of vigor, divine drink and heroic destiny.",
  "3047": "A rousing plea urges Indra, the victorious bull‑like king of Soma, to drink the sacred elixir with the Maruts, slay enemies, and grant the singers fresh protection and triumph.",
  "3048": "A newborn bull, eager for the sacred Soma, drinks the divine milk of his mother, gains strength and heroic vigor, and with Indra’s aid conquers foes and gathers riches.",
  "3049": "A vibrant hymn hails Indra as the mighty, rain‑bringing champion who slays Vṛtra, drives war‑horses, grants riches and victory to those who drink Soma, and is invoked as the supreme protector and giver of strength",
  "3050": "A vibrant hymn urges Indra, the victorious rain‑god and slayer of Vṛtra, to drink the Soma offering, grant abundant cattle and horses, and reward the singers with wealth and protection.",
  "3051": "A vibrant hymn glorifies Indra as the mighty, generous protector who conquers foes, bestows wealth, drinks Soma with the Maruts, and rewards those who praise him with strength and blessings.",
  "3052": "A dawn offering of Soma‑mixed roasted corn, cake and hymns pleads with Indra, the heroic storm‑god, to accept the feast, drink the Soma and be strengthened for his daily battles.",
  "3053": "A vivid hymn urges Indra and the gods to bring gifts, protect the sacrificer’s chariot and herd, bless the warriors and their king, and ensure prosperity and strength for the Bharata people through powerful Soma offerings and heroic praise.",
  "3054": "A vibrant hymn invokes Agni, Heaven, Earth and the pantheon of gods—Varuṇa, Mitra, Savitar, Tvaṣṭar, the Maruts, Vishnu, Indra, and others—to bless the worship",
  "3055": "At dawn the hymn celebrates the all‑encompassing rule of the gods—especially Agni, Varuṇa, Mitra, Vishnu, Bhaga, Tvaṣṭar and Indra—through vivid images of cows, mothers,",
  "3056": "A cosmic hymn declares that the immutable divine order, upheld by a single, unmoving source supporting six burdens and surrounded by three swift, partly hidden powers, governs the world’s hills, heavens, waters and cattle, invoking the triple‑aspected gods",
  "3057": "A vivid hymn praises the wandering cow and its generous bounty, invoking Indra, Agni, the Vasus, and other deities to bless the sacrifice, sustain the world, and grant abundant nourishment and kindness to all.",
  "3058": "A vibrant hymn calls the swift, youthful twin gods—the Aśvins—who ride a radiant chariot, bring light, milk and meat offerings, and travel the heavens and earth to aid humanity, urging them to accept the sacred libations",
  "3059": "A hymn praising Mitra as the ever‑watchful, supportive deity who inspires work, sustains earth and heaven, protects and nourishes all beings, and deserves reverent offerings and worship.",
  "3060": "The hymn celebrates the heroic descendants of Sudhanvan and the Ṛbhus, praising their wealth, skill, and divine friendship with Indra as they perform sacred rites, craft powerful implements, and drink Soma to secure everlasting life and honor.",
  "3061": "A vibrant hymn hails the dawn goddess Uṣas—wise, youthful, and radiant—as she rides a golden chariot, awakens the world with light, guides horses and bulls across earth and heaven, and embodies the law‑bound,",
  "3062": "A fervent devotee implores the great gods—Indra‑Varuṇa, the Maruts, Bṛhaspati, Pūṣan, Savitar, Soma and Mitra‑Varuṇa—to bless him with wealth,",
  "4001": "A vibrant hymn invokes Agni as the divine messenger who brings the gods—especially Varuṇa, the Aditya, and the Maruts—to bless humanity with protection, prosperity, and sacred knowledge, urging him to dispel foes, grant fertile",
  "4002": "A vibrant hymn hails Agni, the immortal fire‑god and divine messenger, urging him to accept human offerings, protect and enrich his faithful worshippers, and guide them to wealth and prosperity.",
  "4003": "A fervent plea to Agni, the fire‑god and priest of the cosmos, asks him to protect, purify and bless the worshippers, invoke the other deities, and accept their offerings while averting harm and ensuring divine favor",
  "4004": "A fiery hymn calls on Agni to unleash his blazing power like a king’s net, shooting burning arrows, protecting the faithful, destroying foes and demons, and rewarding generous worshippers with wealth and safety.",
  "4005": "A hymn praises the fire‑god Agni as the radiant, self‑sufficient giver of hidden wisdom and wealth, urging unified offerings while condemning the sinful and urging the faithful to follow his luminous law.",
  "4006": "A vivid hymn praises Agni as the upright priest‑fire who, like a radiant builder and swift horse, circles the altar, lifts the sacred ladle, and powers the ritual with bright, unstoppable energy, inviting worship and guaranteeing divine favor.",
  "4007": "A vivid hymn celebrates Agni as the first divine fire‑bringer, the swift, ever‑present priest‑messenger who lights every household rite, carries sacrifice to the heavens, and moves like a bright, unstoppable envoy through both worlds.",
  "4008": "A devoted worshipper praises the all‑knowing, immortal envoy who brings wealth and divine favor, guides the gods to the righteous, and, through reverent offerings to Agni, promises continual riches, power and heroic success.",
  "4009": "A prayer to Agni asks the fire‑god to favor the devotee, guide the priest, carry the offerings to the heavens, protect the worshippers, and accept the sacrifice with pleasure.",
  "4010": "A vibrant hymn praises Agni as the radiant, just driver of sacrifice who rewards true devotion, dispels evil, and binds friends and kin in sacred fellowship.",
  "4011": "A radiant, victorious fire‑god who shines beside the sun, inspires poetry, wealth and heroic deeds, dispels sorrow and protects households, and is praised for his powerful, benevolent presence.",
  "4012": "A hymn praises Agni as the fiery benefactor who, when properly fed and honored, grants wealth, victory, health and liberation from sin and suffering to his devoted worshippers.",
  "4013": "A vivid hymn praises the sun’s radiant rise, its divine charioteers, and the celestial forces that guide its light across the sky, marveling at its unstoppable, self‑driven power.",
  "4014": "The hymn calls on the radiant dawn, the sun‑god and the swift Aśvins to join the sacrifice, praising their light‑filled chariots and marveling at the unseen power that holds the heavens aloft.",
  "4015": "A hymn praising Agni as the heroic, horse‑like fire‑carrier who brings offerings to the gods, grants boons, and protects the youthful prince of Sahadeva, invoking the Aśvins for his long life.",
  "4016": "A fervent hymn implores the mighty Indra—Maghavan, the thunder‑god who slays demons, splits mountains, releases waters, and grants victory and wealth—to swiftly answer the singers’ libations and prayers, protect them in battle",
  "4017": "The hymn celebrates Indra’s mighty triumph over the dragon Vṛtra—splitting mountains, releasing floodwaters, shaking heaven and earth, and bestowing wealth, protection, and endless blessings on his worshippers.",
  "4018": "A mythic tale recounts how the newborn Indra, hidden by his mother and later empowered by divine fire, defeats the serpent Vṛtra, frees the rivers, and asserts his unrivaled heroic might while confronting loss, betrayal, and the",
  "4019": "A triumphant hymn celebrates Indra’s thunderous power as he alone defeats the dragon Vṛtra, breaks the flood‑blocked rivers, frees the lands and streams, and is praised as the supreme, truth‑born ruler who restores order for",
  "4020": "A fervent plea to Indra, the thunder‑wielding protector and war‑god, asks him to ride forth on his tawny steeds, bless the sacrifice, grant courage and riches, and defeat the hymn‑singer’s enemies",
  "4021": "A vibrant plea calls on Indra—heroic lord of thunder, wealth, and victory—to protect and bless the singers, bring his mighty power and bounty from heaven, earth and the seas, and inspire triumph and devotion in their rites.",
  "4022": "A vibrant hymn praises Indra as the thunder‑wielding hero who conquers dragons, frees the imprisoned, brings rain and wealth, and bestows strength, wisdom and cattle upon his worshippers.",
  "4023": "A priest asks the god how his mighty, Soma‑filled sacrifice brings wealth, protection and friendship to mortals, praising his endless generosity, law‑upholding power and the bond that links divine favor to human devotion.",
  "4024": "A vibrant hymn urges warriors to praise and invoke Indra, the mighty god of strength, so he will grant them riches, victory in battle against Vṛtra, and the power to protect their families, while offering Soma and libations to secure",
  "4025": "A hymn praises Indra as the beloved protector who grants light and victory to those who offer Soma and devotion, rewarding the pious, brave and sincere with his favor and shelter.",
  "4026": "A boastful sage claims to have been the ancient creator, sun, and heroic bird who delivered rain, Soma and countless libations to the gods and mortals, conquering forts and guiding waters while proclaiming his supreme, joyous power.",
  "4027": "A soul born in the womb envisions a heroic journey where a falcon‑borne warrior, propelled by divine strength, battles foes, is struck by an archer’s arrow, and finally offers milk and meat to Indra for joyous celebration.",
  "4028": "Indra and Soma, allied as friends, unleash mighty forces that break barriers, flood the land, drive away hostile tribes, and free trapped dwellings with their powerful weapons.",
  "4029": "A vibrant plea calls Indra, the thunder‑riding, wealth‑granting protector, to ride his tawny steeds, bless the sacrifice, grant safe roads and abundant bounty, and rejoice with the hymn‑singers.",
  "4030": "A rousing tribute hails Indra, the mighty Vṛtra‑slayer, as the unrivaled champion who drives the sun’s chariot, crushes demons, rescues the oppressed, shatters foes and storms, and secures",
  "4031": "A vibrant plea to Indra asks the ever‑growing, powerful friend to rush to the worshippers with his mighty forces, generous wealth and protective aid—drawing him in with hymns, sharing his strength with the Sun, and securing abundant",
  "4032": "A fervent hymn calls the swift, mighty Indra—slayer of Vṛtra and lord of cattle—to aid and protect the singers, grant them abundant food, wealth, and heroic renown, and celebrate his power with songs, offerings",
  "4033": "A vibrant hymn praises the skilled Ṛbhus—divine craftsmen who fashioned the cosmic cow, created sacred vessels, cultivated fertile lands and wealth, and, through their devotion and partnership with the gods, protect and enrich the sacrificial rites.",
  "4034": "The hymn exuberantly invites the powerful Ṛbhus, Vājas, Indra, and other divine heroes to partake in the sacrificial drink, promising them wealth, glory, and communal celebration as they join the ritual and bestow riches upon",
  "4035": "The hymn calls the mighty, craft‑skilled Ṛbhus—sons of Sudhanvan—to accept a lavish libation of Soma, praising their wondrous four‑fold cup, swift steeds, and treasure‑making powers while urging them",
  "4036": "A hymn glorifies the divine craftsmen Vājas and the Ṛbhus for creating a wondrous three‑wheeled, ever‑steady chariot that sustains heaven and earth, bestows wealth, youth, and heroic power,",
  "4037": "A vibrant hymn invites the Vājas and Ṛbhukṣans—divine, war‑like sons of Indra—to accept the sacrificial offering of Soma, praising their strength, golden chariots, and horses, and asking",
  "4038": "A vivid hymn celebrates the heroic, swift steed Dadhikrās—gifted by the ancient gods, a fierce, colorful falcon‑like warrior who races into battle, conquers enemies, gathers spoils, and brings abundance and glory",
  "4039": "A vibrant hymn celebrates the swift, divine horse Dadhikrās—gifted by the gods to aid mortals, bring strength and nourishment, and ensure safe passage through life’s trials.",
  "4040": "A vivid hymn hails the swift, bird‑like Dadhikrāvan—linked to dawn, fire, water and the sun—as a powerful, war‑seeking force whose rapid, falcon‑like flight brings food, strength and",
  "4041": "A fervent hymn praises Indra‑Varuṇa as generous, thunder‑wielding protectors who reward those who honor them with feasts, grant wealth and victory in battle, and nurture prosperity like a milk‑rich cow.",
  "4042": "A boastful hymn declares Varuṇa‑Indra as the supreme ruler who commands the cosmos, creates order, controls waters, defeats monsters, and grants wealth and prosperity to his worshippers.",
  "4043": "A vibrant plea calls on the swift, sun‑daughter‑chosen twin horsemen to hear the hymn, grant swift aid, protect the singers, and receive rich offerings in exchange for their divine, battle‑winning grace.",
  "4044": "A vibrant hymn calls the twin sun‑riders, the Aśvins, to arrive in their shining chariot, bearing wealth, protection and divine favor, to partake in the sacrifice, drink Soma, and bless the worshippers with abundant",
  "4045": "A vivid hymn praises the twin sun‑riders, the Aśvins, whose radiant chariot streaks across the sky bearing meat‑laden offerings, swift horses and swans, dispelling darkness and inviting worshippers to honor them with",
  "4046": "A vibrant hymn calls on the wind‑god Vāyu and mighty Indra, together riding a golden chariot with countless steeds, to rush to the sacrificial feast and drink the sacred Soma juice first.",
  "4047": "The hymn calls the bright wind‑god Vāyu, together with Indra, to ride their chariot teams, accept the sacred Soma offered at the rite, and lend their mighty strength to the worshippers.",
  "4048": "A vivid hymn calls on the wind‑god Vāyu, urging him to ride his shining chariot drawn by countless strong steeds, to lift curses, share divine drink, and bring forth the hidden riches of the foe.",
  "4049": "A jubilant plea to Indra and Bṛhaspati to accept the sacred Soma offering, granting abundant wealth and horses while they revel in the drink and the celebratory feast.",
  "4050": "A vibrant hymn praises the mighty, thunder‑voiced deity who upholds the world, creates wells and light, drives cattle and rain, grants wealth and heroic lineage, and is invoked for protection, prosperity and the removal of enemies.",
  "4051": "A vivid hymn celebrates the radiant dawn‑goddesses who burst forth from the east, driving away darkness, inspiring generosity and heroic vigor, and granting wealth and blessings to those who honor them.",
  "4052": "The hymn celebrates Dawn as a radiant, motherly goddess who drives away darkness and hatred, brings wealth and joy, and is the beloved friend of the divine twins, likening her light to a herd of cattle grazing across the sky.",
  "4053": "A vibrant hymn praises Savitar, the radiant divine ruler who awakens, sustains and protects all life with his triple‑fold light, granting safety, prosperity and blessings to his worshippers.",
  "4054": "We invoke Savitar, the sun‑god who first gave the gods immortality and then grants humans wealth, life after life, and forgiveness for our faults, trusting his unstoppable power to sustain the world, bless our daily rites, and secure",
  "4055": "A prayer to the Vedic deities asks the heavens, earth, and gods—especially Varuṇa, Mitra, Indra, Agni, and Aditi—to protect and sustain humanity, grant wealth and safety, and uphold the sacred",
  "4056": "A vibrant hymn invokes Heaven and Earth as the supreme, radiant pair who together sustain the world, guide sacrifice, and bless humanity with protection, harmony and victorious song.",
  "4057": "A prayer to the field’s lord and divine helpers asks for abundant milk, meat, sweet crops, fertile soil, and safe, prosperous work of ploughs, oxen and people, so that the harvest and life may flow richly and unh",
  "4058": "A vivid hymn celebrates the sacred, sweet oil—likened to ocean waves, divine speech, and flowing rivers—that powers the sacrifice, unites gods and mortals, and sustains the cosmos.",
  "5001": "Agni, awakened by human offerings at dawn, rises like a blazing white horse to the heavens, fuels the priest’s rites, spreads his seven gifts, and is praised as the radiant, ever‑present fire‑god who unites worshippers",
  "5002": "A vivid hymn celebrates a hidden youthful mother‑son duo who, revealed in radiant glory, triumphs over demons and binds the world with fire, urging Agni to free them and grant protection and prosperity.",
  "5003": "The hymn praises Agni as the all‑encompassing fire‑god who embodies and unites the powers of Varuṇa, Mitra, Indra, Rudra and others, serves as the priest and messenger of sacrifice, grants wealth",
  "5004": "A vibrant prayer to Agni, the fire‑god and divine patron, asks him to bless the sacrificer with strength, protection, wealth and fame, to drive away enemies, and to carry the offering to the gods so that the worshipper",
  "5005": "A vibrant hymn calls the fire‑god Agni, along with Indra, the Maruts, Varuṇa, the three goddesses, and other divine forces, to receive abundant offerings, spread their protective warmth, and grant prosperity and",
  "5006": "The hymn praises Agni, the fire‑god who welcomes cattle, swift horses and noble people, grants food, wealth and protection to those who honor him, and is invoked to sustain homes and bless the singers with abundance.",
  "5007": "Friends are urged to offer proper food and praise to Agni, the supreme, ever‑young fire‑god who energizes gatherings, sustains life, guides distant rites, transforms wood into flame, and grants fame, wisdom, and protection to",
  "5008": "A hymn hails Agni as the ancient, fiery master of the household who fuels sacrifices, spreads wealth, protects against floods, and inspires reverent songs, embodying the bright, multiform divine force that sustains and enlightens all life",
  "5009": "A vivid prayer to Agni, the fire‑god who carries mortal offerings, fuels sacrifice, grants strength and protection, and transforms the world with his relentless, awe‑inspiring flame.",
  "5010": "A fiery Agni is invoked to blaze a path of wealth, power and protection, granting strength, prosperity and victorious support to the hymn‑singers and their leaders.",
  "5011": "A vibrant hymn celebrates Agni, the fire‑god born of the heavens and earth, as the pure, powerful guardian and priest‑messenger who fuels sacrifice, carries gifts, and unites the people in awe‑inspiring devotion.",
  "5012": "A devotee implores Agni, the fiery law‑giver, to uphold truth and order, denouncing deceitful allies while pledging sincere sacrifice and loyalty to the eternal Red Steer’s rule.",
  "5013": "Calling on Agni with fervent songs, we pray that the fire‑priest who bridges heaven and earth spreads his power through our sacrifice, granting us heroic strength and abundant wealth.",
  "5014": "A fiery priest of the heavens, Agni is praised as the immortal messenger who carries our offerings aloft, burns away darkness and foes, and is honored with oil‑laden ladles and soaring hymns.",
  "5015": "A hymn praises the ancient, wise fire‑god as the radiant, supportive force who sustains heaven and humanity through sacrifice, grants wealth and protection, and overcomes foes while nurturing all life.",
  "5016": "A vibrant hymn hails Agni as the radiant, youthful fire‑god who, like a trusted friend and powerful priest, swiftly brings wealth, strength and protection to those who honor him.",
  "5017": "A prayer invokes Agni, the powerful fire deity, to protect and bless the sacrificer and his people with strength, wealth and divine favor.",
  "5018": "At dawn the hymn praises Agni, the beloved fire‑god who receives offerings and grants vitality, protection and fame to chiefs and heroes who uphold the rites, rewarding them with abundant blessings and swift, unharmed steeds.",
  "5019": "A cryptic hymn celebrates a powerful, ever‑renewing force—born from its own husk, guarded and gifted, shining like light and fire, conquering all while offering the cherished “milk” of the sister‑pair.",
  "5020": "A hymn calls on Agni, the victorious fire‑god, to bless and protect the worshippers, grant them wealth and law, and lead their feasts and rites with strength and wisdom.",
  "5021": "The hymn praises Agni as the sacred fire that, like the ancient lawgiver Manus, is kindled by the devout to carry offerings, please the gods, and embody divine law and nourishment for humanity.",
  "5022": "A vibrant hymn calls upon Agni, the radiant priest‑god, to lead the sacrifice, bless the household, and inspire the Atris’ joyous songs of devotion.",
  "5023": "Calling on Agni’s dazzling power, the hymn begs the fire‑god to flood the community with victorious wealth, protect their herds, vanquish foes, and shine as a pure, radiant priest who secures their prosperity.",
  "5024": "We call Agni, our bright, friendly fire, to draw near, grant us splendid wealth, protect us from sinners, and bless our friends with happiness.",
  "5025": "A vibrant hymn praises Agni as the generous, powerful fire‑god who brings gifts, protection, victory and wealth to worshippers, urging all to honor him with devotion and song.",
  "5026": "A fiery priest, Agni, is invoked to summon and seat all the gods for the sacrificial feast, bearing the offering, spreading holy grass, and ensuring the rite’s success.",
  "5027": "A heroic devotee praises the youthful fire‑god, thanking him for generous gifts of oxen, horses and wealth, invoking his protection and power to uphold law and secure further blessings.",
  "5028": "A fiery Agni, the radiant messenger who carries offerings to the gods, is praised as the powerful, luminous king who protects the household, defeats enemies, and ensures blessed sacrifice.",
  "5029": "A vibrant hymn celebrates Indra’s mighty deeds—drinking Soma, slaying the dragon Vṛtra, splitting heaven and earth, and leading the Maruts and other gods in triumphant praise for his heroic strength and generosity.",
  "5030": "A vivid hymn celebrates Indra’s heroic deeds—riding a golden chariot, slaying dragons and demons, rewarding warriors with abundant cattle and libations, and inspiring awe and gratitude among the singers.",
  "5031": "A vivid hymn hails Indra’s mighty chariot rides, his battles against serpents and darkness, his gifts of water and wealth, and his support of warriors and priests, urging him to keep protecting and empowering his people.",
  "5032": "Indra, the thunder‑god, bursts open mountains, frees blocked rivers, slays the monstrous Dānava and dragon, overwhelms all foes with his lightning and axe, and is praised as the unrivaled protector who grants strength and prosperity",
  "5033": "A vibrant hymn glorifies Indra’s mighty, horse‑driven power, urging him to protect the people, defeat their enemies, and shower them with wealth and splendid steeds.",
  "5034": "A powerful deity who drinks Soma, wields a thousand‑pointed weapon, rewards generous sacrificial offerings, defeats monsters and rivals, and grants wealth and protection to those who honor him is praised as the unstoppable, warlike benefactor of the",
  "5035": "A bold plea to Indra asks the mighty god to unleash his unstoppable strength, defeat enemies, protect the warriors’ chariot, and bring victorious spoils and fame at dawn.",
  "5036": "A fervent prayer asks Indra, the thunder‑armed king of horses, to pour out his wealth, drink the Soma, strengthen his power, and protect the singers and their cattle with his mighty chariot and divine might.",
  "5037": "A vibrant hymn praises the swift, sun‑like deity who, with holy oil, fire, Soma and ritual rites, drives his chariot to victory, protects his people, and wins favor from the sun and fire gods.",
  "5038": "A vibrant plea to Indra, the mighty protector and giver of wealth, asks him to share his boundless strength, golden bounty, and divine favor so that humanity may be safely guarded and prosper.",
  "5039": "A vibrant hymn praises Indra as the generous, stone‑throwing king who bestows wealth, grants strength, and inspires poets and singers to honor his boundless munificence.",
  "5040": "A hymn praising Indra as the mighty, Soma‑drinking thunder‑god who defeats the darkness‑spreading demon Svarbhanu, restores the sun’s light, and is aided by the sage Atri and other divine helpers.",
  "5041": "A fervent hymn petitions the myriad Vedic deities—Mitra‑Varuṇa, Indra, the Maruts, Rudra, the Ashvins, Agni, Vāyu, and others—to bless the worshipper with",
  "5042": "A fervent hymn pleads that the singer’s devoted song reach the gods—Varuṇa, Mitra, Aditi, Bhaga, Indra, Savitar, Rudra, the Maruts, Bṛhaspati, the",
  "5043": "A vibrant hymn invokes the gods, especially Indra, the Aśvins, Vāyu, Agni and others, to bless the ritual with sweet Soma, abundant riches, protection, health and joyous prosperity for all.",
  "5044": "A vibrant hymn praises the ever‑young, law‑upholding deity who draws power through song, protects the faithful, commands nature and sacrifice, and promises shelter, victory and divine wisdom to those who awaken and honor him.",
  "5045": "A vivid hymn celebrates the dawn‑bards opening the mountain and heaven’s doors, invoking Sun, Indra, Agni and the Maruts to bless sacrificial rites, protect the faithful, and usher in prosperity and divine favor.",
  "5046": "A devoted seeker, bound like a horse to the cosmic pole, implores every deity and divine pair—Agni, Indra, Varuṇa, Mitra, the Maruts, Viṣṇu, Rudra, the godd",
  "5047": "A vibrant hymn urges diligent work and celebrates the mighty mother’s youthful arrival, describing cosmic journeys, divine guardians, and the harmonious interplay of celestial forces as a plea for health, strength, and a stable, lofty home.",
  "5048": "A powerful, divine force spreads like magical water across the heavens, granting heroes strength, extending life, striking the deceitful, controlling time and wealth, and urging the pious onward, though humans can scarcely comprehend its true nature.",
  "5049": "A priest invokes the sun‑god Savitar, the wealth‑granting Bhaga, the heroic Aśvins and other divine forces to bless the community with prosperity, protection and auspicious days through sincere worship.",
  "5050": "A prayer asks the guiding deity to grant wealth, fame, protection from enemies, and continual blessings, praising his power and seeking his favor for prosperity and safety.",
  "5051": "A lively invitation calls all the gods—Agni, Indra, Vāyu, the Aśvins, Dawn, and the divine families—to join the ritual feast, drink the freshly pressed Soma mixed with curd, and grant health",
  "5052": "A vibrant hymn celebrates the fierce, lightning‑fast Maruts—heroic, protective storm‑gods who guard humanity, wield shining weapons, and inspire bold songs and sacrifices for their boundless strength and generous gifts.",
  "5053": "A vivid hymn praises the storm‑god Maruts and their swift, shining chariots, invoking their rain‑blessed generosity, heroic youth, and protective power over worshippers and their crops.",
  "5054": "A vivid hymn praises the storm‑riding Maruts as mighty, water‑laden warriors who thunder across sky and mountain, wield lightning and riches, protect kings and sages, and grant endless life‑giving strength to all who honor them.",
  "5055": "The hymn glorifies the Maruts as dazzling, unstoppable warriors who ride swift, golden‑armed chariots, command the rain and sky, defeat enemies, and are begged for protection, wealth and eternal favor.",
  "5056": "A vivid hymn summons the fierce, gold‑adorned Marut warriors and their swift, red‑haired steeds, urging them from heaven to thunder across earth like powerful beasts, shaking mountains and drawing chariots to bring glorious gifts.",
  "5057": "A vibrant plea to the thunder‑riding Maruts, urging them to unleash their storm‑filled power, weapons and wealth upon the worshippers so they may grant prosperity, cattle, steeds and heroic fame.",
  "5058": "A vibrant hymn hails the youthful, thunder‑riding Maruts—Rudra’s powerful, rain‑bringing heroes on swift horses who blaze with divine brilliance, wield magical strength, and bless the world with storm, fire and abundance.",
  "5059": "A vivid hymn celebrates the thunder‑riding Maruts—storm‑born heroes who thunder across the sky on radiant steeds, shaking earth, scattering clouds, and bestowing prosperity like victorious bridegrooms to all who hear their mighty, rain‑",
  "5060": "A vibrant hymn praises Agni and the fierce, thunder‑riding Maruts—brother‑like Rudras who thunder across the sky on swift chariots, shaking earth and heaven, and who together with the fire‑god receive offerings",
  "5061": "A vivid hymn calls heroic, horse‑riding warriors and their powerful, generous wives to bring wealth, cattle and divine favor, praising their swift steeds, glorious deeds and the sacred songs that guide and protect humanity.",
  "5062": "A vivid hymn praises the twin divine kings Mitra‑Varuṇa as the powerful, law‑upholding patrons who harness the sun’s horses, command rain and fertility, guard the world from chaos, and invite their followers to share in their",
  "5063": "The hymn praises the twin deities Mitra‑Varuṇa as the cosmic guardians who command rain, thunder, clouds and the sun, uphold divine law and order, and bestow life‑giving blessings on kings and heroes alike.",
  "5064": "A hymn calls on the protective deities Varuṇa and Mitra, praising their loving embrace and asking them to grant safety, prosperity and strength to the singer and his community.",
  "5065": "A devout speaker calls on the mighty, law‑upholding gods Varuṇa and Mitra for protection, strength, and guidance, urging them to safeguard both chiefs and sages alike.",
  "5066": "A wise appeal calls the two supreme gods—embodiments of law and cosmic order—to receive offerings, grant victorious power, illuminate humanity, and support the sages’ quest for fame and protection.",
  "5067": "The hymn praises the divine pair Varuṇa and Mitra—along with the other gods—as supreme protectors and benefactors who uphold law, grant wealth and safety, and deserve continual reverence.",
  "5068": "Sing to the twin lords Varuṇa and Mitra, the lofty, law‑keeping kings who command rain, floods and riches both earthly and celestial, and whose pure, guile‑free power sustains all wealth and authority.",
  "5069": "A hymn praises the twin deities Varuṇa and Mitra for governing the three heavens, sustaining life with water and cattle, and upholding eternal order, while invoking Aditi’s blessings for safety, wealth, and offspring at all times.",
  "5070": "The hymn pleads to the gods—Varuṇa, Mitra, the Rudras, and the mighty protector—to extend their grace, provide food, guard and subdue enemies, so that the speaker and his descendants may safely enjoy their own",
  "5071": "Varuṇa and Mitra, the mighty guardians who vanquish foes, are summoned to join the offering, fill the hymn with their power, and drink the pressed soma of the worshipper.",
  "5072": "We sing to Varuṇa and Mitra, inviting them to sit on the holy grass and share the Soma, so that their law‑giving presence may bless us with peace and aid our sacrifice.",
  "5073": "The hymn praises the twin divine horsemen, the Aśvins, urging them to appear wherever they are, celebrating their swift, wealth‑bringing rides, radiant chariot, heroic deeds, and their role as benefactors who bring blessings,",
  "5074": "The hymn calls the twin Aśvins, asking where they have gone, praising their swift, youthful power and generosity, and imploring them to return with their divine steeds to aid the supplicant and share the offered feast.",
  "5075": "A passionate prayer calls the twin divine horsemen, the Aśvins, to ride their shining chariot, bring wealth and healing, and join the sacrifice with joyous song.",
  "5076": "The hymn calls the bright dawn‑god Agni and the swift, ever‑present twin horsemen Aśvins to ride in on their chariot, bless the ritual libations at every hour, bring health, wealth and heroic joy,",
  "5077": "A vibrant hymn urges early‑morning worship of the swift, golden‑charioted twin deities, praising their generous gifts, protective power and the blessings of wealth, health and joy they bestow on devoted seekers.",
  "5078": "The hymn urges the twin divine horsemen, the Aśvins, to rush like swans and falcons to receive the offering, break open the tree and release the unborn child, granting a safe birth and prosperity.",
  "5079": "A vibrant prayer implores the radiant Dawn, daughter of the sky, to awaken and shower the singers with abundant wealth, heroic fame, and flourishing herds, praising her brilliance and swift steeds.",
  "5080": "The hymn celebrates Dawn as a radiant, orderly goddess who rides a chariot drawn by purple oxen, banishes darkness, opens the way to happiness and blessings, and renews the world with her ever‑changing, glorious light."
}